       IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.
       AUTHOR. Mathieu.
       
       PROCEDURE DIVISION.
           
           DISPLAY 'HELLO WORLD'.

           STOP RUN.
           